In [13]:
import numpy as np
randomNumber = np.random.random(10)*10
a = []
for i in range(0, len(list(np.round(list(randomNumber),0)))):
    a += [int(list(np.round(list(randomNumber),0))[i])]
a

[5, 7, 9, 6, 10, 1, 6, 1, 10, 7]

In [87]:
import numpy as np
array1 = []

for i in range(0, 10):
    randomNumber = np.random.randint(10)
    array1[i] = randomNumber
array1

IndexError: list assignment index out of range

In [134]:
a = input()
b = input()
c = int(a)+int(b)
c

3
12

15

In [145]:
a = "SEC 20180212 250"
b = a[0:3]
c = a[4:12]
d = a[13:]
d

'250'

In [156]:
a = "sec 2018W28 250"
a2 = a.upper()
b = a2[0:3]
c = a2[4:8] + a2[9:11]
d = a2[12:]
c

'201828'

In [8]:
a = [120,150,300,500,1000,100,2000]
MAX = max(a)
MIN = min(a)
a.remove(MAX)
a.remove(MIN)
a

[120, 150, 300, 500, 1000]

In [12]:
dic = {"name":"sec","id":"300000","address":"suwon"}
del dic["id"]
dic

{'name': 'sec', 'address': 'suwon'}

In [40]:
a = []
for i in range(0, len(list(np.round(np.linspace(1,5,11))))):
    a += [int(np.round(np.linspace(1,5,11))[i])]

In [41]:
a

[1, 1, 2, 2, 3, 3, 3, 4, 4, 5, 5]

In [42]:
score = 80
if score >=90 :
    print("A")
elif score >=80 :
    print("B")
else :
    print("C")

B

In [86]:
List  = ["A01","한국","A02","미국" ,"A03","프랑스"]
List2 = [None]*3
preFix = "A"
j = 0
for i in range(0, len(List)):
    if(List[i].count(preFix) == 1) :
        List2[j] = List[i]
        j= j + 1
List2.type

AttributeError: 'list' object has no attribute 'type'

In [85]:
list1 = {"1", "2"}
list1.types

AttributeError: 'set' object has no attribute 'types'

In [8]:
inputX = int(input())
inputY = int(input())
inputZ = input()
if (inputZ == "+"):
    result = inputX + inputY
elif (inputZ == "-"):
    result = inputX - inputY
elif (inputZ == "*"):
    result = inputX * inputY
elif (inputZ == "/"):
    result = inputX / inputY
else:
    print("똑바로 입력하세요.")

4
2
h
똑바로 입력하세요.
270

In [9]:
import pandas as pd

In [10]:
customerData = pd.read_csv("../dataset/kopo_customerdata.csv")

In [11]:
customerData.head()

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0

In [15]:
a = customerData[(customerData.GENDER == "Male") & (customerData.EMAIL > 0)]

In [16]:
a.head()

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
16,1154228,State2,2,Male,0,1,1,0,18200,0,0,18200,0,0,1,0
81,393246,State2,2,Male,0,1,1,1,18200,0,0,18200,0,0,1,0
206,2532568,State2,2,Male,1,1,1,0,48000,48000,0,0,0,0,1,0
216,487928,State2,2,Male,0,1,1,0,72300,0,27900,44400,0,0,1,0

In [18]:
data = """
park 800905-1049118
kim  700905-1059119
"""

In [43]:
result = []
for line in data.split("\n"):
    word_result = []
    for word in line.split(" "):
        if len(word) == 14 and word[:6].isdigit() and word[7:].isdigit():
            word = word[:6] + "-*******"
        word_result.append(word)
    result.append(" ".join(word_result))
print("\n".join(result))

park 800905-*******
kim  700905-*******

In [45]:
import re
data = """
lee 600905-1049118
lim  500905-1059119
"""

pat = re.compile("(\d{6})[-]\d{7}")
print(pat.sub("\g<1>-*******", data))

lee 600905-*******
lim  500905-*******

In [60]:
import re
p = re.compile('[a-z]+')

In [74]:
m = p.match("python")
if m:
    print("Match found :")
else : 
    print("No match")

Match found :

In [75]:
kpv = pd.read_csv("../dataset/kopo_product_volume.csv")
kpv.head()

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      A01       ST0001    201415  810144
1      A01       ST0002    201415  128999
2      A01       ST0001    201418  671464
3      A01       ST0002    201418  134467
4      A01       ST0001    201413  470040

In [88]:
a = kpv[(kpv.PRODUCTGROUP =="ST0002") & (kpv.VOLUME > 30000)]
a.head()

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
1      A01       ST0002    201415  128999
3      A01       ST0002    201418  134467
5      A01       ST0002    201413  140297
7      A01       ST0002    201411  145509
9      A01       ST0002    201416  140313

In [90]:
kc = pd.read_csv("../dataset/kopo_customerdata.csv")
kc.head()

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0

In [92]:
kc[["CUSTOMERCODE", "STATENAME", "GENDER", "TOTAL_AMOUNT"]].head()

   CUSTOMERCODE STATENAME  GENDER  TOTAL_AMOUNT
0       1503989    State2    Male         30300
1       1190338    State2    Male         46500
2       1424715    State2  Female         22700
3       2483305    State2    Male         31400
4       1178802    State2    Male         44900

In [94]:
kc.iloc[0:6,[1,3]]

  STATENAME  GENDER
0    State2    Male
1    State2    Male
2    State2  Female
3    State2    Male
4    State2    Male
5    State2    Male

In [95]:
import numpy as np

In [97]:
cd = pd.read_csv("../dataset/customerdata.csv")

In [98]:
cd.head()

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
1  A14219   3642.441950    2          4.0    2.682023      Sleeping-dog
2  A15312   3653.884565    2          5.0    3.208202      Sleeping-dog
3  A16605   3713.211107    2          6.6    0.900000        Early-bird
4  B10634   3391.074215    2          4.2    2.453656      Sleeping-dog

In [102]:
cd["PRODUCT_NEW_AGE"] = np.where(cd["PRODUCTAGE"] < 1 , 1 ,\
                                np.where(cd["PRODUCTAGE"] < 2, 2, \
                                     np.where(cd["PRODUCTAGE"] < 3,3,5 )))
cd.head()

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCT_NEW_AGE
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3

In [103]:
cd.groupby(["EMI"]).max()

,CUSTID,AVERAGEPRICE,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCT_NEW_AGE
EMI,,,,,,
1,Y12458,3419.462596,6.3,2.994395,Sleeping-dog,3
2,Z19835,4166.533130,6.9,3.483573,Sleeping-dog,5
3,Z13534,4296.873743,6.9,2.055707,Early-bird,3

In [104]:
regionMasterData = pd.read_csv("../dataset/kopo_region_mst.csv")

In [105]:
selectExample = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [10]:
List = [1,2,3,1,2,4,1,3,6,87,98,21431,11,55476,55476]
len(List)

15

In [3]:
List.count(min(List))

3

In [4]:
List.count(max(List))

2

In [12]:
for i in range (0, List.count(min(List))) :
    List.remove(min(List))
for i in range (0, List.count(max(List))) :
    List.remove(max(List))
List

[2, 3, 2, 4, 3, 6, 87, 98, 21431, 11]

In [13]:
len(List)

10